In [ ]:
#Project (Titanic Survivors DataAnalysis) By Pranav Uikey.

import pandas as pd
import numpy as np
df = pd.DataFrame(pd.read_csv("train.csv"))         #read .csv file
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape                                          #the shape of the DataFrame(Row, Coloumn)

(891, 12)

In [ ]:
df.isnull()                                       #Null values in the DataFrame

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [ ]:
df.isnull().sum()                                 #Total number of null values in columns

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#Only the coloumn with more that 35% data missing should be stored in the DataFrame

drop_col = df.isnull().sum() [df.isnull().sum( )>(35/100 * df.shape [0])]     #shows coloumn which has more than 35% data missing 
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index                                      #Index of the coloumn to be dropped

Index(['Cabin'], dtype='object')

In [ ]:
df.drop (drop_col. index, axis=1, inplace=True)      #Dropping the colomn
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df["Embarked"].describe()                            #Describing the coloumn with string values

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
df ["Embarked"].fillna("S", inplace=True)             #Replace the null values with the most frequent value
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [ ]:
df.corr()                                              #Checking corelation between rows and columns

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [ ]:
#To optimize the DataFrame, we combine "SibSp" and "Parch" to make a new coloumn "Family"
df["Family"] = df["SibSp"] + df["Parch"]
df.drop(["SibSp", "Parch"], axis=1, inplace= True)      #Dropping the two coloumns
df.corr()                                                #New correlation

             PassengerId  Survived    Pclass       Age      Fare    Family
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500  0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067 -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000  0.217138
Family         -0.040143  0.016639  0.065997 -0.301914  0.217138  1.000000

In [ ]:
#Family doesn't have much correlation with survival rate
#Check whether passenger with family or Alone affects the survival rate of an individual

df ['Alone'] = [0 if df ['Family'][i]>0 else 1 for i in df.index]          #Check whether the passenger was alone or not
df.head()

   PassengerId  Survived  Pclass  ... Embarked Family  Alone
0            1         0       3  ...        S      1      0
1            2         1       1  ...        C      1      0
2            3         1       3  ...        S      0      1
3            4         1       1  ...        S      1      0
4            5         0       3  ...        S      0      1

[5 rows x 11 columns]

In [ ]:
#Grouping both the coloumns
df.groupby(['Alone']) ['Survived'].mean()         #mean value of both coloumns

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [ ]:
#Correlation between Passenger is aloen and Ticket Fare
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [ ]:
#Check whether Sex of the passengers affects their Survival Rate
df ['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]   #1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [ ]:
#Check whether the place of embarkment affects the Survuval Rate
df.groupby(['Embarked'])['Survived'].mean()           #the mean value of both columns

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64